Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.PowerConsumptionUnitEnum
The Mep power consumption unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.PowerConsumptionUnitEnum.WATT
Watt.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.PowerConsumptionUnitEnum.KILOWATT
Kilowatt.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.PowerConsumptionUnitEnum.UNKNOWN
unknown unit.